{
  "meta": {
    "label": "Deutsch",
    "title": "Equipmentlisten-Editor"
  },
  "language": {
    "label": "Sprache",
    "helper": "Lokal gespeichert für die Offline-Nutzung.",
    "status": "Sprache aktualisiert und lokal gespeichert."
  },
  "navigation": {
    "sidebar": {
      "dashboard": "Dashboard",
      "project": "Projekt",
      "templates": "Vorlagen",
      "help": "Hilfe"
    },
    "topbar": {
      "newProject": "Neues Projekt",
      "openProject": "Projekt öffnen",
      "saveNow": "Jetzt speichern",
      "exportProject": "Projekt exportieren",
      "exportPdf": "PDF exportieren",
      "shareBackup": "Backup kopieren",
      "downloadBackup": "Backup herunterladen",
      "restoreData": "Daten wiederherstellen",
      "importBackup": "Backup importieren"
    },
    "helper": {
      "dashboard": "Hier starten: Projekt auswählen oder erstellen, Importe verwalten und Backups offline schützen.",
      "project": "Aktive Equipmentliste mit Autosave bearbeiten. Exporte und Teilen liegen oben in der Leiste.",
      "templates": "Kits sicher wiederverwenden. Vorlagen sind hier und ergänzen ohne Überschreiben.",
      "help": "Offline-fokussierte Hilfe zu Autosave, Backups, Wiederherstellung und Exporten."
    }
  },
  "help": {
    "title": "Hilfe & Dokumentation",
    "subtitle": "Offline-fokussierte Hinweise für sichere Equipment-Listen.",
    "sections": [
      {
        "title": "Start im Dashboard",
        "description": "Dashboard → Projekt auswählen/erstellen → Equipmentliste im Projekt-Tab bearbeiten.",
        "items": [
          "Projekt anlegen, damit es sofort lokal gespeichert wird, auch offline.",
          "Projekt auswählen, um ohne Datenverlust weiterzuarbeiten.",
          "Dashboard-Aktionen kümmern sich um Importe, Wiederherstellung und Geräte-Backups.",
          "Im Projekt-Tab oben exportieren, PDF erstellen oder teilen.",
          "Vorlagen liegen im Vorlagen-Tab und ergänzen Equipment ohne Überschreiben."
        ]
      },
      {
        "title": "Kategorien und Items aufbauen",
        "description": "Strukturiere Equipment nach Abteilung oder Case für schnelleres Packen.",
        "items": [
          "Kategorien anlegen und Items mit Menge, Einheit und Status erfassen.",
          "Die Vorschläge merken frühere Items und übernehmen Details schnell.",
          "Projekt-Notizen für Crew-Infos, Abholung oder Rückgabe nutzen.",
          "Autosave schützt jede Änderung während der Bearbeitung."
        ]
      },
      {
        "title": "Vorlagen und Exporte sicher nutzen",
        "description": "Vorlagen ergänzen Equipment, ohne bestehende Listen zu ersetzen.",
        "items": [
          "Aktives Projekt als Vorlage speichern, wenn ein Kit wiederkehrt.",
          "Vorlagen aus dem Vorlagen-Tab hinzufügen, ohne Einträge zu verlieren.",
          "Projekt-Export und PDF-Export findest du im Projekt-Tab."
        ]
      }
    ]
  },
  "offline": {
    "title": "Offline-Workflow",
    "description": "Alle Funktionen laufen ohne Verbindung.",
    "steps": [
      "Projekt offline erstellen oder öffnen.",
      "„Jetzt speichern“ vor Übergabe oder Schließen des Geräts nutzen.",
      "Backup-Datei für Übergabe oder Langzeitablage herunterladen.",
      "Backup auf einem anderen Gerät importieren, um Listen sicher zu kombinieren.",
      "„Vom Geräte-Backup wiederherstellen“ nutzen, wenn Speicher repariert werden muss."
    ],
    "footer": "Backups bleiben auf dem Gerät, sofern du sie nicht exportierst oder teilst."
  },
  "documentation": {
    "title": "Dokumentation",
    "subtitle": "Wichtige Sicherheitsfunktionen laufen automatisch, manuelle Kontrolle bleibt verfügbar.",
    "sections": [
      {
        "title": "Speichern und Autosave",
        "description": "Änderungen werden sofort geschützt und in Backups gespiegelt.",
        "items": [
          "Autosave läuft nach jeder Änderung und hält redundante Kopien.",
          "Geräte-Backups werden alle 30 Minuten aktualisiert, auch im Leerlauf.",
          "„Jetzt speichern“ erzwingt eine sofortige Synchronisierung lokal.",
          "Statusmeldungen bestätigen, wenn Speichern oder Reparatur fertig ist."
        ]
      },
      {
        "title": "Teilen und Export",
        "description": "Teilen ohne Online-Abhängigkeit oder externe Dienste.",
        "items": [
          "Zwischenablage-Teilen kopiert ein vollständiges Backup für Übergaben.",
          "Projekt-Export lädt nur das aktive Projekt für sichere Übergaben herunter.",
          "PDF-Export öffnet eine druckfertige Liste für die Produktion.",
          "Aktionen im Projekt-Tab halten Exporte und Teilen direkt an der Liste."
        ]
      },
      {
        "title": "Backup und Wiederherstellung",
        "description": "Mehrere Backups schützen deine Daten auf demselben Gerät.",
        "items": [
          "Backup-Dateien für Langzeitablage oder Gerätewechsel speichern.",
          "Backups importieren, um Daten zusammenzuführen statt zu überschreiben.",
          "Bei Problemen vom Geräte-Backup wiederherstellen.",
          "Dashboard-Aktionen halten Importe und Wiederherstellung nah an deinen Projekten.",
          "Vorlagen werden im Vorlagen-Tab verwaltet und überschreiben keine Daten."
        ]
      }
    ]
  }
}
