{
  "meta": {
    "label": "Deutsch"
  },
  "language": {
    "label": "Sprache",
    "helper": "Lokal gespeichert für die Offline-Nutzung.",
    "status": "Sprache aktualisiert und lokal gespeichert."
  },
  "navigation": {
    "sidebar": {
      "label": "Seitenleiste",
      "tabs": {
        "dashboard": "Dashboard",
        "project": "Projekt",
        "templates": "Vorlagen",
        "help": "Hilfe"
      },
      "helper": "Nutze die Tabs, um zwischen Dashboard, Projekt-Editor, Vorlagen und Hilfe zu wechseln."
    },
    "topBar": {
      "label": "Aktionen in der oberen Leiste",
      "actions": {
        "saveNow": "Jetzt speichern",
        "exportPdf": "PDF exportieren",
        "downloadBackup": "Backup herunterladen",
        "importBackup": "Backup importieren",
        "restoreBackup": "Vom Geräte-Backup wiederherstellen",
        "shareClipboard": "Über Zwischenablage teilen"
      },
      "helper": "Aktionen speichern, exportieren und teilen offline. Autosave schützt jede Änderung."
    },
    "helpers": {
      "projectEmpty": "Projekt auswählen oder erstellen, um die Equipment-Liste zu bearbeiten.",
      "projectNotes": "Notizen erscheinen in Exporten und Backups für jedes Projekt.",
      "templatesEmpty": "Noch keine Vorlagen. Aktives Projekt speichern, um deine Bibliothek aufzubauen."
    }
  },
  "help": {
    "title": "Hilfe & Dokumentation",
    "subtitle": "Offline-fokussierte Hinweise für sichere Equipment-Listen.",
    "sections": [
      {
        "title": "Dashboard-Workflow folgen",
        "description": "Dashboard → Projekt auswählen oder erstellen → Equipment-Liste bearbeiten.",
        "items": [
          "Zuerst ein Projekt erstellen, damit Autosave jede Änderung schützt.",
          "Das Dashboard hält Produktionen getrennt und leicht wieder zu öffnen.",
          "Im Projekt-Tab Details, Kategorien und Items pflegen."
        ]
      },
      {
        "title": "Projekt sicher bearbeiten",
        "description": "Projekte bleiben lokal und behalten Notizen in jedem Export und Backup.",
        "items": [
          "Kategorien anlegen und Items mit Menge, Einheit und Status erfassen.",
          "Projekt-Notizen sind in Exporten für Crew-Infos und Abholung enthalten.",
          "Autosave hält redundante Kopien nach jeder Änderung."
        ]
      },
      {
        "title": "Vorlagen und Exporte",
        "description": "Vorlagen liegen im Tab Vorlagen. Exporte und Backups findest du im Projektbereich.",
        "items": [
          "Aktives Projekt als Vorlage speichern, wenn ein Kit wiederkehrt.",
          "Vorlagen hinzufügen, ohne vorhandene Einträge zu verlieren.",
          "Projekt-Top-Bar und Bereich „Speichern, teilen, wiederherstellen“ für PDF-Export, Backups und Teilen nutzen."
        ]
      }
    ]
  },
  "offline": {
    "title": "Offline-Workflow",
    "description": "Alle Funktionen laufen ohne Verbindung.",
    "steps": [
      "Dashboard öffnen und offline ein Projekt auswählen oder erstellen.",
      "„Jetzt speichern“ vor Übergabe oder Schließen des Geräts nutzen.",
      "Backup-Datei für Übergabe oder Langzeitablage herunterladen.",
      "Backup auf einem anderen Gerät importieren, um Listen sicher zu kombinieren.",
      "„Vom Geräte-Backup wiederherstellen“ nutzen, wenn Speicher repariert werden muss."
    ],
    "footer": "Backups bleiben auf dem Gerät, sofern du sie nicht exportierst oder teilst."
  },
  "documentation": {
    "title": "Dokumentation",
    "subtitle": "Wichtige Sicherheitsfunktionen laufen automatisch, manuelle Kontrolle bleibt verfügbar.",
    "sections": [
      {
        "title": "Speichern und Autosave",
        "description": "Autosave startet, sobald ein Projekt erstellt oder geöffnet wird.",
        "items": [
          "Jede Änderung wird lokal gespeichert und in redundante Backups gespiegelt.",
          "„Jetzt speichern“ erzwingt eine sofortige Synchronisierung lokal.",
          "Statusmeldungen bestätigen, wenn Speichern oder Reparatur abgeschlossen ist."
        ]
      },
      {
        "title": "Teilen, Exporte und Vorlagen",
        "description": "Exporte und Vorlagen bleiben in der App und sind offline-first.",
        "items": [
          "Die Projekt-Top-Bar für den PDF-Export der aktiven Equipment-Liste nutzen.",
          "Vorlagen im Tab Vorlagen verwalten und auf Projekte anwenden.",
          "Zwischenablage-Teilen kopiert ein vollständiges Backup für Übergaben."
        ]
      },
      {
        "title": "Backup und Wiederherstellung",
        "description": "Mehrere Backups schützen deine Daten auf demselben Gerät.",
        "items": [
          "Backup-Dateien für Langzeitablage oder Gerätewechsel speichern.",
          "Backups importieren, um Daten zusammenzuführen statt zu überschreiben.",
          "Bei Problemen vom Geräte-Backup wiederherstellen."
        ]
      }
    ]
  }
}
