{
  "meta": {
    "label": "Deutsch"
  },
  "language": {
    "label": "Sprache",
    "helper": "Lokal gespeichert für die Offline-Nutzung.",
    "status": "Sprache aktualisiert und lokal gespeichert."
  },
  "navigation": {
    "sidebar": {
      "dashboard": "Dashboard",
      "project": "Projekt",
      "templates": "Vorlagen",
      "help": "Hilfe"
    },
    "topBar": {
      "saveNow": "Jetzt speichern",
      "shareBackup": "Backup teilen",
      "exportPdf": "PDF exportieren",
      "downloadBackup": "Backup speichern",
      "restoreBackup": "Daten wiederherstellen"
    }
  },
  "helpers": {
    "dashboard": "Projekt auswählen oder erstellen, um zu starten.",
    "project": "Alle Änderungen werden lokal per Autosave gespeichert.",
    "templates": "Vorlagen sind hier gespeichert und können vom Dashboard aus angewendet werden.",
    "exports": "Exporte und Backups findest du in den Dashboard-Aktionen."
  },
  "help": {
    "title": "Hilfe & Dokumentation",
    "subtitle": "Dashboard → Projekt auswählen oder erstellen → Equipment-Liste bearbeiten.",
    "sections": [
      {
        "title": "Im Dashboard starten",
        "description": "Das Dashboard führt dich durch den gesamten Ablauf, auch offline.",
        "items": [
          "Projekt auswählen oder neu erstellen.",
          "Im Tab „Projekt“ die aktive Liste bearbeiten.",
          "Vorlagen liegen im Tab „Vorlagen“ und werden im Dashboard angewendet.",
          "Exporte, Importe, Backups und Wiederherstellung sind in den Dashboard-Aktionen."
        ]
      },
      {
        "title": "Equipment sicher bearbeiten",
        "description": "Autosave schützt jede Änderung, auch ohne Verbindung.",
        "items": [
          "Kategorien anlegen und Items mit Menge, Einheit und Status erfassen.",
          "Die Vorschläge merken frühere Items und übernehmen Details schnell.",
          "Projekt-Notizen für Crew-Infos, Abholung oder Rückgabe nutzen.",
          "Projekte jederzeit wechseln, damit Produktionen getrennt bleiben."
        ]
      },
      {
        "title": "Vorlagen nutzen und teilen",
        "description": "Wiederverwendbare Kits und Exporte bleiben geschützt.",
        "items": [
          "Aktives Projekt als Vorlage speichern, wenn ein Setup wiederkehrt.",
          "Vorlagen fügen Equipment hinzu, ohne vorhandene Einträge zu überschreiben.",
          "Zwischenablage-Teilen und PDF-Export bleiben lokal, bis du Dateien weitergibst."
        ]
      }
    ]
  },
  "offline": {
    "title": "Offline-Workflow",
    "description": "Alle Funktionen laufen ohne Verbindung.",
    "steps": [
      "Projekt offline erstellen oder öffnen.",
      "„Jetzt speichern“ vor Übergabe oder Schließen des Geräts nutzen.",
      "Backup-Datei für Übergabe oder Langzeitablage herunterladen.",
      "Backup auf einem anderen Gerät importieren, um Listen sicher zu kombinieren.",
      "„Vom Geräte-Backup wiederherstellen“ nutzen, wenn Speicher repariert werden muss."
    ],
    "footer": "Backups bleiben auf dem Gerät, sofern du sie nicht exportierst oder teilst."
  },
  "documentation": {
    "title": "Dokumentation",
    "subtitle": "Wichtige Sicherheitsfunktionen laufen automatisch, manuelle Kontrolle bleibt verfügbar.",
    "sections": [
      {
        "title": "Speichern und Autosave",
        "description": "Änderungen werden sofort geschützt und in Backups gespiegelt.",
        "items": [
          "Autosave läuft nach jeder Änderung und hält redundante Kopien.",
          "Geräte-Backups werden alle 30 Minuten aktualisiert, auch im Leerlauf.",
          "„Jetzt speichern“ erzwingt eine sofortige Synchronisierung lokal.",
          "Statusmeldungen bestätigen, wenn Speichern oder Reparatur fertig ist."
        ]
      },
      {
        "title": "Teilen und Export",
        "description": "Exporte liegen im Dashboard und bleiben standardmäßig offline.",
        "items": [
          "Top-Bar-Aktionen nutzen, um ein Backup zu teilen oder eine PDF zu exportieren.",
          "Exporte und Downloads werden lokal gespeichert und in den Dashboard-Aktionen gelistet.",
          "Teilen bleibt offline, solange Dateien nicht manuell weitergegeben werden."
        ]
      },
      {
        "title": "Backup und Wiederherstellung",
        "description": "Mehrere Backups schützen deine Daten auf demselben Gerät.",
        "items": [
          "Backup-Dateien für Langzeitablage oder Gerätewechsel speichern.",
          "Backups importieren, um Daten zusammenzuführen statt zu überschreiben.",
          "Bei Problemen vom Geräte-Backup wiederherstellen.",
          "Vorlagen und Projektdaten bleiben zusammen im lokalen Speicher."
        ]
      }
    ]
  }
}
