{
  "meta": {
    "label": "English",
    "title": "Gear list editor"
  },
  "language": {
    "label": "Language",
    "helper": "Saved locally for offline use.",
    "status": "Language updated and saved locally."
  },
  "navigation": {
    "sidebar": {
      "dashboard": "Dashboard",
      "project": "Project",
      "templates": "Templates",
      "help": "Help"
    },
    "topbar": {
      "newProject": "New project",
      "openProject": "Open project",
      "saveNow": "Save now",
      "exportProject": "Export project",
      "exportPdf": "Export PDF",
      "shareBackup": "Copy backup",
      "downloadBackup": "Download backup",
      "restoreData": "Restore data",
      "importBackup": "Import backup"
    },
    "helper": {
      "dashboard": "Start here: select or create a project, manage imports, and protect backups while offline.",
      "project": "Edit the active gear list with autosave. Exports and sharing live in the top bar.",
      "templates": "Reuse kits safely. Templates live here and add gear without overwriting your list.",
      "help": "Offline-first guidance for autosave, backups, restores, and safe exports."
    }
  },
  "help": {
    "title": "Help & documentation",
    "subtitle": "Offline-first guidance for safe gear lists.",
    "sections": [
      {
        "title": "Start from the dashboard",
        "description": "Dashboard → select/create project → edit the gear list in the Project tab.",
        "items": [
          "Create a project to save locally the moment it exists, even offline.",
          "Select a project to continue editing without losing data.",
          "Dashboard actions handle imports, restores, and device backups.",
          "Use the Project tab top bar for export, PDF, and share actions.",
          "Templates live in the Templates tab and can be added without overwriting gear."
        ]
      },
      {
        "title": "Build categories and items",
        "description": "Organize gear by department or case for faster packing.",
        "items": [
          "Add categories, then list items with quantity, unit, and status.",
          "Typeahead remembers previous items so you can reuse details quickly.",
          "Use project notes for crew instructions, pickup info, or returns.",
          "Autosave keeps every change protected while you edit."
        ]
      },
      {
        "title": "Use templates and exports safely",
        "description": "Templates add gear without replacing what you already have.",
        "items": [
          "Save the active project as a template for repeat kits.",
          "Apply templates from the Templates tab to extend your list safely.",
          "Project export and PDF export live in the Project tab top bar."
        ]
      }
    ]
  },
  "offline": {
    "title": "Offline workflow",
    "description": "Every feature works without a connection.",
    "steps": [
      "Create or open a project while offline.",
      "Use “Save now” before handing off or closing the device.",
      "Download a backup file for transfer or long-term storage.",
      "Import a backup file on another device to merge gear lists safely.",
      "Use “Restore from device backup” if local storage needs recovery."
    ],
    "footer": "Backups stay on-device unless you export or share them."
  },
  "documentation": {
    "title": "Documentation",
    "subtitle": "Key safety behaviors are automatic, with manual controls when you need them.",
    "sections": [
      {
        "title": "Saving and autosave",
        "description": "Edits are protected immediately and mirrored to backups.",
        "items": [
          "Autosave runs after every change and keeps redundant copies.",
          "Device backups refresh every 30 minutes, even while idle.",
          "“Save now” forces an immediate sync across local storage locations.",
          "Status updates confirm when saves and repairs are complete."
        ]
      },
      {
        "title": "Sharing and exports",
        "description": "Share without leaving offline mode or exposing data online.",
        "items": [
          "Clipboard sharing copies a full backup for quick handoffs.",
          "Project export downloads only the active project for safe handoffs.",
          "PDF export opens a print-ready list for production reference.",
          "Project tab actions keep exports and sharing next to your gear list."
        ]
      },
      {
        "title": "Backup and restore",
        "description": "Multiple backups protect your data on the same device.",
        "items": [
          "Download backup files for long-term storage or device migration.",
          "Import backups to merge rather than overwrite your current data.",
          "Restore from device backup if storage needs recovery.",
          "Dashboard quick actions keep imports and restores close to your projects.",
          "Templates are managed in the Templates tab and never overwrite your data."
        ]
      }
    ]
  }
}
