{
  "language.name": "English",
  "view.editor": "Editor",
  "view.help": "Help",
  "view.documentation": "Documentation",
  "view.description": "Switch views without leaving offline mode.",
  "help.title": "Help center",
  "help.subtitle": "Quick answers for staying productive offline.",
  "help.quickStart.title": "Quick start",
  "help.quickStart.step1": "Create a project and add production details.",
  "help.quickStart.step2": "Add categories for departments, then list gear items inside each one.",
  "help.quickStart.step3": "Autosave runs after every change; watch the status panel for confirmation.",
  "help.quickStart.step4": "Use templates to reuse proven kits without overwriting current lists.",
  "help.safety.title": "Offline data safety",
  "help.safety.step1": "All data stays on this device in IndexedDB plus redundant device backups.",
  "help.safety.step2": "Use Save now before closing the app for an extra checkpoint.",
  "help.safety.step3": "Download a backup file and store it offline for disaster recovery.",
  "help.safety.step4": "Restore from device backup if local storage is ever compromised.",
  "help.sharing.title": "Sharing & exports",
  "help.sharing.step1": "Share via clipboard copies a JSON backup for offline handoff.",
  "help.sharing.step2": "Import backups merges data without deleting existing projects.",
  "help.sharing.step3": "PDF export opens a print-ready layout for crew and rentals.",
  "help.sharing.step4": "Project notes are included in exports and backups.",
  "help.return.title": "Back to editing",
  "help.return.body": "Switch to the Editor view to update gear lists, templates, and backups.",
  "help.return.button": "Go to editor",
  "docs.title": "Documentation",
  "docs.subtitle": "Detailed workflows for data safety, backups, and offline sharing.",
  "docs.dataSafety.title": "Data safety architecture",
  "docs.dataSafety.body1": "Every change is autosaved to IndexedDB and mirrored to device backups.",
  "docs.dataSafety.body2": "Backups keep the latest and previous versions to reduce risk of data loss.",
  "docs.saving.title": "Saving workflow",
  "docs.saving.body1": "Use Save now to trigger an immediate checkpoint before traveling or closing the app.",
  "docs.saving.body2": "Autosave batches edits for performance while preserving every change locally.",
  "docs.backup.title": "Backup, import, restore",
  "docs.backup.body1": "Download backup creates a JSON file you can store offline.",
  "docs.backup.body2": "Import backup merges incoming data and preserves current projects and templates.",
  "docs.backup.body3": "Restore from device backup rehydrates the latest reliable copy after storage issues.",
  "docs.sharing.title": "Offline sharing",
  "docs.sharing.body1": "Share via clipboard copies a backup payload for offline transfer.",
  "docs.sharing.body2": "Paste it into a local file or note and move it between devices safely.",
  "docs.pdf.title": "PDF export",
  "docs.pdf.body1": "PDF export prints the active project with categories, quantities, statuses, and notes.",
  "docs.templates.title": "Templates & suggestions",
  "docs.templates.body1": "Templates store reusable categories and items without overwriting existing lists.",
  "docs.templates.body2": "Typeahead remembers item names, units, and details to speed up entry.",
  "docs.translations.title": "Translations",
  "docs.translations.body1": "Translation files live in src/i18n and can be extended per locale.",
  "docs.translations.body2": "Add new UI copy to the locale JSON files to keep help and workflows aligned.",
  "docs.offline.title": "Recommended offline workflow",
  "docs.offline.body1": "Save now, download a backup, and optionally share via clipboard before travel.",
  "docs.offline.body2": "Restore or import backups when switching devices or recovering from storage issues."
}
