{
  "meta": {
    "label": "English"
  },
  "language": {
    "label": "Language",
    "helper": "Saved locally for offline use.",
    "status": "Language updated and saved locally."
  },
  "navigation": {
    "sidebar": {
      "label": "Sidebar",
      "tabs": {
        "dashboard": "Dashboard",
        "project": "Project",
        "templates": "Templates",
        "help": "Help"
      },
      "helper": "Use the tabs to move between the dashboard, project editor, templates, and help."
    },
    "topBar": {
      "label": "Top bar actions",
      "actions": {
        "saveNow": "Save now",
        "exportPdf": "Export PDF",
        "downloadBackup": "Download backup",
        "importBackup": "Import backup",
        "restoreBackup": "Restore from device backup",
        "shareClipboard": "Share via clipboard"
      },
      "helper": "Actions save, export, and share while staying offline. Autosave still protects every change."
    },
    "helpers": {
      "projectEmpty": "Select or create a project to start editing the gear list.",
      "projectNotes": "Notes appear in exports and backups for every project.",
      "templatesEmpty": "No templates yet. Save the active project to build your library."
    }
  },
  "help": {
    "title": "Help & documentation",
    "subtitle": "Offline-first guidance for safe gear lists.",
    "sections": [
      {
        "title": "Follow the dashboard flow",
        "description": "Dashboard → select or create a project → edit the gear list.",
        "items": [
          "Create a project first so autosave can protect every edit.",
          "The dashboard keeps each production separate and easy to reopen.",
          "Open the project tab to update details, categories, and items."
        ]
      },
      {
        "title": "Edit the project safely",
        "description": "Projects stay local and keep notes with every export and backup.",
        "items": [
          "Add categories, then list items with quantity, unit, and status.",
          "Project notes are included in exports for crew instructions and pickup details.",
          "Autosave keeps redundant copies after every change."
        ]
      },
      {
        "title": "Templates and exports",
        "description": "Templates live in the Templates tab. Exports and backups live in the Project view.",
        "items": [
          "Save the active project as a template whenever you repeat a kit.",
          "Apply templates to add gear without overwriting existing lists.",
          "Use the Project top bar and Save, share, restore panel for PDF export, backups, and sharing."
        ]
      }
    ]
  },
  "offline": {
    "title": "Offline workflow",
    "description": "Every feature works without a connection.",
    "steps": [
      "Open the dashboard and select or create a project while offline.",
      "Use “Save now” before handing off or closing the device.",
      "Download a backup file for transfer or long-term storage.",
      "Import a backup file on another device to merge gear lists safely.",
      "Use “Restore from device backup” if local storage needs recovery."
    ],
    "footer": "Backups stay on-device unless you export or share them."
  },
  "documentation": {
    "title": "Documentation",
    "subtitle": "Key safety behaviors are automatic, with manual controls when you need them.",
    "sections": [
      {
        "title": "Saving and autosave",
        "description": "Autosave starts as soon as a project is created or opened.",
        "items": [
          "Every change is saved locally and mirrored to redundant backups.",
          "“Save now” forces an immediate sync across local storage locations.",
          "Status updates confirm when saves and repairs are complete."
        ]
      },
      {
        "title": "Sharing, exports, and templates",
        "description": "Exports and templates stay inside the app and remain offline-first.",
        "items": [
          "Use the Project top bar to export a PDF of the active gear list.",
          "Templates are managed in the Templates tab and can be applied to any project.",
          "Clipboard sharing copies a full backup for quick handoffs."
        ]
      },
      {
        "title": "Backup and restore",
        "description": "Multiple backups protect your data on the same device.",
        "items": [
          "Download backup files for long-term storage or device migration.",
          "Import backups to merge rather than overwrite your current data.",
          "Restore from device backup if storage needs recovery."
        ]
      }
    ]
  }
}
